Show / Hide Table of Contents
Class ConcreteMemberData
Concrete member data base
Inheritance
System.Object
OpenObject
OpenAttribute
ConcreteMemberData
ConcreteMemberDataEc2
Inherited Members
 OpenAttribute.Element
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class ConcreteMemberData : OpenAttribute
Constructors
Improve this Doc   View Source
ConcreteMemberData()
Constructor
Declaration
public ConcreteMemberData()
Properties
Improve this Doc   View Source
CalculationSetup
Calculation setup
Declaration
public CalculationSetup CalculationSetup { get; set; }
Property Value
 Type |  Description
 CalculationSetup
Improve this Doc   View Source
MemberType
Gets or sets the structural type of member.
Declaration
public ConcreteMemberType MemberType { get; set; }
Property Value
 Type |  Description
 ConcreteMemberType
Improve this Doc   View Source
TimeAxis
Time axis
Declaration
public TimeAxis TimeAxis { get; set; }
Property Value
 Type |  Description
 TimeAxis
Improve this Doc   View Source
TwoWaySlabType
two way slab type
Declaration
public TwoWaySlabType TwoWaySlabType { get; set; }
Property Value
 Type |  Description
 TwoWaySlabType
 Improve this Doc
 View Source